<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"06db43c802011ef9a40f36fcaf08d95a50f472ad5fbcbe30490de9f76b8b4cbc","plan_job_ref":"Job Terraform checks on pull request #41 at https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13510589321","plan_out_hash":"25de7a2e6b673e17e12e71cf4bfb1c361fc71991b47be7bf5492535d64ca6551","plan_hash":"a97f099fb41c40ed0deaf1ec13370c20f2857f34176d5298adba8e5f4e0e034e","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __./__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.repositories["sudoblark.python.core"].data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "sudoblark.python.core"
+       sha        = (known after apply)
    }

  # module.repositories["sudoblark.python.core"].github_repository.repository will be updated in-place
!~  resource "github_repository" "repository" {
        id                          = "sudoblark.python.core"
        name                        = "sudoblark.python.core"
!~      visibility                  = "private" -> "public"
#        (31 unchanged attributes hidden)

-       pages {
-           custom_404 = true -> null
-           html_url   = "https://sudoblark.github.io/sudoblark.python.core/" -> null
-           status     = "built" -> null
-           url        = "https://api.github.com/repos/sudoblark/sudoblark.python.core/pages" -> null

-           source {
-               branch = "gh-pages" -> null
-               path   = "/" -> null
            }
        }
    }

  # module.repositories["sudoblark.python.core"].github_repository_file.gitignore will be updated in-place
!~  resource "github_repository_file" "gitignore" {
!~      content             = <<-EOT
            # Created by .ignore support plugin (hsz.mobi)
            ### Python template
            # Byte-compiled / optimized / DLL files
            __pycache__/
            *.py[cod]
            *$py.class
            
            # C extensions
            *.so
            
            # Distribution / packaging
            .Python
            env/
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            *.egg-info/
            .installed.cfg
            *.egg
            
            # PyInstaller
            #  Usually these files are written by a python script from a template
            #  before PyInstaller builds the exe, so as to inject date/other infos into it.
            *.manifest
            *.spec
            
            # Installer logs
            pip-log.txt
            pip-delete-this-directory.txt
            
            # Unit test / coverage reports
            htmlcov/
            .tox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *,cover
            .hypothesis/
            
            # Translations
            *.mo
            *.pot
            
            # Django stuff:
            *.log
            local_settings.py
            
            # Flask stuff:
            instance/
            .webassets-cache
            
            # Scrapy stuff:
            .scrapy
            
            # Sphinx documentation
            docs/_build/
            
            # PyBuilder
            target/
            
            # IPython Notebook
            .ipynb_checkpoints
            
            # pyenv
            .python-version
            
            # celery beat schedule file
            celerybeat-schedule
            
            # dotenv
            .env
            
            # virtualenv
            venv/
            ENV/
            
            # Spyder project settings
            .spyderproject
            
            # Rope project settings
            .ropeproject
            ### VirtualEnv template
            # Virtualenv
            # http://iamzed.com/2009/05/07/a-primer-on-virtualenv/
            [Bb]in
            [Ii]nclude
            [Ll]ib
            [Ll]ib64
            [Ll]ocal
            [Ss]cripts
            pyvenv.cfg
            .venv
            pip-selfcheck.json
            
            ### JetBrains template
            # Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider
            # Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839
            
            # User-specific stuff
            .idea/**/workspace.xml
            .idea/**/tasks.xml
            .idea/**/usage.statistics.xml
            .idea/**/dictionaries
            .idea/**/shelf
            
            # AWS User-specific
            .idea/**/aws.xml
            
            # Generated files
            .idea/**/contentModel.xml
            
            # Sensitive or high-churn files
            .idea/**/dataSources/
            .idea/**/dataSources.ids
            .idea/**/dataSources.local.xml
            .idea/**/sqlDataSources.xml
            .idea/**/dynamic.xml
            .idea/**/uiDesigner.xml
            .idea/**/dbnavigator.xml
            
            # Gradle
            .idea/**/gradle.xml
            .idea/**/libraries
            
            # Gradle and Maven with auto-import
            # When using Gradle or Maven with auto-import, you should exclude module files,
            # since they will be recreated, and may cause churn.  Uncomment if using
            # auto-import.
            # .idea/artifacts
            # .idea/compiler.xml
            # .idea/jarRepositories.xml
            # .idea/modules.xml
            # .idea/*.iml
            # .idea/modules
            # *.iml
            # *.ipr
            
            # CMake
            cmake-build-*/
            
            # Mongo Explorer plugin
            .idea/**/mongoSettings.xml
            
            # File-based project format
            *.iws
            
            # IntelliJ
            out/
            
            # mpeltonen/sbt-idea plugin
            .idea_modules/
            
            # JIRA plugin
            atlassian-ide-plugin.xml
            
            # Cursive Clojure plugin
            .idea/replstate.xml
            
            # SonarLint plugin
            .idea/sonarlint/
            
            # Crashlytics plugin (for Android Studio and IntelliJ)
            com_crashlytics_export_strings.xml
            crashlytics.properties
            crashlytics-build.properties
            fabric.properties
            
            # Editor-based Rest Client
            .idea/httpRequests
            
            # Android studio 3.1+ serialized cache file
            .idea/caches/build_file_checksums.ser
            
            # idea folder, uncomment if you don't need it
            .idea
            
            ### Terraform template
            # Local .terraform directories
            **/.terraform/*
            
            # .tfstate files
            *.tfstate
            *.tfstate.*
            
            # Crash log files
            crash.log
            crash.*.log
            
            # Exclude all .tfvars files, which are likely to contain sensitive data, such as
            # password, private keys, and other secrets. These should not be part of version
            # control as they are data points which are potentially sensitive and subject
            # to change depending on the environment.
            *.tfvars
            *.tfvars.json
            
            # Ignore override files as they are usually used to override resources locally and so
            # are not checked in
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            
            # Include override files you do wish to add to version control using negated pattern
            # !example_override.tf
            
            # Include tfplan files to ignore the plan output of command: terraform plan -out=tfplan
            # example: *tfplan*
            
            # Ignore CLI configuration files
            .terraformrc
            terraform.rc
            # Lock file automatically managed by Terraform
            **/.terraform.lock.hcl
            
            # PyTest
            **/.pytest_cache
            .vscode/settings.json
            
            # MacOS
            .DS_Store
            .ado/templates/query_status.json
            
            # Temp dev files
            dev_scratchpad/*
          - 
          - # Mkdocs HTML output
          - site/
        EOT
        id                  = "sudoblark.python.core/.gitignore"
#        (9 unchanged attributes hidden)
    }

  # module.repositories["sudoblark.terraform.ci-cd-observability-monitoring"].github_branch_protection.main will be created
+   resource "github_branch_protection" "main" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = "************"
+       require_conversation_resolution = true
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = true
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }

+       required_status_checks {
+           strict = true
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #41](https://github.com/sudoblark/sudoblark.terraform.github/actions/runs/13510589321)